# SQL Assignment-1

In [1]:
#Python integration with SQL(Internal Storage)
#Import Libraries
import pandas as pd
import sqlite3

In [6]:
#Command to create table
create_table= """ CREATE TABLE Ages1 (name VARCHAR(128), age INTEGER);"""
print("Table is Ready")

Table is Ready

In [8]:
executeSQL = sqlite3.connect('assignment') # connect to a database which we create in sql server
cur = executeSQL.cursor() #In order to execute SQL statements and fetch results from SQL queries, we will need to use a database cursor.
cur.execute(create_table) # to execute Python Sql queries

In [10]:
#Insert  values in class_exam2 table
cur.execute('''INSERT INTO Ages1 VALUES ('Mara', 28), ('Otto', 33) , ('Fyn', 31), ('Neshawn', 17)''')

In [11]:
statement = '''SELECT * FROM Ages1'''
cur.execute(statement)

print("All the data")
output_all = cur.fetchall()
for row_all in output_all:
  print(row_all)

All the data
('Mara', 28)
('Otto', 33)
('Fyn', 31)
('Neshawn', 17)

In [13]:
# Commit the changes
executeSQL.commit()

In [19]:
#putting all the values into a dataframe
df1=pd.DataFrame(output_all,columns=list(zip(*cur.description))[0])
df1

      name  age
0     Mara   28
1     Otto   33
2      Fyn   31
3  Neshawn   17

In [39]:
statement= '''SELECT hex(name || age) AS X FROM Ages1 ORDER BY X'''
cur.execute(statement)

In [42]:
output_all1= cur.fetchall()

In [28]:
#putting all the values into a dataframe
df1=pd.DataFrame(output_all1,columns=list(zip(*cur.description))[0])
df1

                    X
0          46796E3331
1        4D6172613238
2  4E65736861776E3137
3        4F74746F3333

In [43]:
print(df1.iloc[0])

X    46796E3331
Name: 0, dtype: object